\bпервым\b|\Bервым\b|\Bрвым\b|\Bвым\b|\Bым\b|\Bм\b|\bпервы\B|\bперв\B|\bпер\B|\bпе\B|\bп\B
\bпервый\b|\Bервый\b|\Bрвый\b|\Bвый\b|\Bый\b|\Bй\b|
\bпервая\b|\bперва\B|\Bервая\b|\Bрвая\b|\Bвая\b|\Bая\b|\Bя\b
\bодин\b|\bоди\B|\bод\B|\bо\B|\Bдин\b|\Bин\b|\Bн\b
\bодна\b|\bодн\B|\bод\B|\bо\B|\Bдна\b|\Bна\b|\Bа\b
\bодно\b|\bодн\B|\bод\B|\bо\B|\Bдно\b|\Bно\b|\Bо\b




\b     Совпадает на границе слова
\B     Совпадает не на границе слова





\bпервым\b|\Bервым\b|\Bрвым\b|\Bвым\b|\Bым\b|\Bм\b|\bпервы\B|\bперв\B|\bпер\B|\bпе\B|\bп\B
|\bпервый\b|\Bервый\b|\Bрвый\b|\Bвый\b|\Bый\b|\Bй\b|
|\bпервая\b|\bперва\B|\Bервая\b|\Bрвая\b|\Bвая\b|\Bая\b|\Bя\b
|\bодин\b|\bоди\B|\bод\B|\bо\B|\Bдин\b|\Bин\b|\Bн\b
|\bодна\b|\bодн\B|\bод\B|\bо\B|\Bдна\b|\Bна\b|\Bа\b
|\bодно\b|\bодн\B|\bод\B|\bо\B|\Bдно\b|\Bно\b|\Bо\b
